{
	"name": "Shop Flavor",
	"resultPattern": "{shopflavor}",
	"tables": [
		{
			"name": "shopflavor",
			"entries": [
"Hundreds of iron nails hang suspended from the ceiling by strings, a superstitious ward against evil.",
"One wall is plastered with old wanted posters. The proprietor is either a rogue fanboy, or a real law-and-order type.",
"The air smells of exotic aromatics. Small bowls of spices and oils dot the shelves.",
"The shopkeeper has brought plants indoors and placed them in pots. Curiously, these specimens seem to serve no obvious culinary or herbalist purpose.",
"The merchant's service counter is a repurposed church door.",
"The light in this dim shop is provided by terrarium jars holding large, phosphorescent beetles.",
"Hundreds of invoices or receipts litter the shop -- stuck on spikes, pinned to the walls, bound in stacks with twine.",
"There is a brazier made from a large buckler suspended from the ceiling.",
"There is a live fish in a small glass bowl full of water on the counter.",
"The wall behind the counter holds dozens of overdue statements of account. One some the names are circled and red and someone has written epithets such as 'Thieving Rogue,' 'Villain,' 'Liar and Cheat.'",
"The shop is very quiet. Fabric draperies on the walls muffle the sounds from the street.",
"A sign behind the counter warns: 'No Spells or Glamours in My Shop.'",
"The door to the shop has an elaborate set of locks on the interior, along with a sturdy bar that can be dropped in place.",
"The goods in this shop are all labelled with neat cards in a delicate calligraphic hand.",
"A prominent sign announces, 'No Credit / No Barter / Crown's Coin or Get Thee Forthwith Out.'",
"A sign behind the counter says, 'Shoplifters Will Be Charged for Every Crossbow Bolt They Obtain.'",
"A rug on the floor is worn and patched, but it was rare and expensive when new.",
"The shopkeeper seems to be performing an inventory: his stock is piled on the floor and stacked for easy counting.",
"There is a painted wooden figurine of a fat burgher in the window. He welcomes customers in with a mechanical wave of his hand.",
"A wind chime announces patrons as they enter the door.",
"This shop was clearly originally built as a stable and converted later. The goods are arranged by category within the stalls.",
"A battered but impressive battle axe decorates the wall behind the counter. It looks to be securely attached.",
"The walls in this room are papered with spent Scrolls of Protection.",
"Someone has painted murals on every uncovered bit of wall. The scenes are of forests and pastoral fields, and dotted with frolicking unicorns. The artist had obviously never seen an actual unicorn.",
"On the counter is a vial half-full of clear liquid. It bears the enigmatic label, 'Tears.'",
"The shopkeeper has advanced cataracts, and their pupils are quite white. However, they exhibit no other sign of impaired vision.",
"The merchant keeps a hound in this shop, a quiet fellow who shows mild interest in patrons and would appreciate a pat.",
"There is a vicious-looking dog chained behind the counter. She will growl menacingly at anyone who attempts to get too close to her master.",
"It is warm in here, and the shopkeeper is waving a fan made of a raven's wing.",
"Flies have infiltrated this shop, and there are blown-glass traps containing live and dead insects scattered on the shelves.",
"A lad — perhaps the shopkeeper's son — is applying a feather duster to the merchandise in this meticulously-tidy shop.",
"What looks to be a lady and her maid are clucking over the merchandise in one of the cases. The merchant is standing by, obviously exasperated.",
"The merchant has apparently just received a shipment, and is enthusiastically rummaging around in a barrel filled with packing straw.",
"The merchant has a large scroll and a quill out on the counter, and appears to be going over the accounts.",
"The shopkeeper is vigorously scrubbing something off the floor with a brush and bucket.",
"When the patrons enter, the shopkeeper is on a ladder accessing a high shelf.",
"A sign declares that the shop once served a long-dead local lord.",
"Behind the counter is what appears to be a small portrait and memorial to the shopkeeper's spouse. Fresh-cut flowers are in a metal vase beneath the image.",
"The ceiling is covered with bits of ribbon of every color. They look very dusty.",
"The shopkeeper is finishing a small tureen of soup as the patrons enter.",
"The shopkeeper is reading a book. Holding up one finger for patience, they will finish their passage before greeting the customers.",
"The shopkeeper is knitting as the door opens.",
"The shop is crowded with patrons, and the clerk is moving from person to person, obviously flustered.",
"The shopkeeper's arms are covered with tattoos, older ones denoting military service, more recent ones indicating family and professional affiliations.",
"A well-fed cat sits on the counter.",
"Hanging from the ceiling is an odd construction of wood and paper in the shape of a dragonfly. (It's a kite.)",
"The keeper in this shop is meticulous and will obsessively rearrange anything the customers touch.",
"There is a tray of tiny poppy-seed buns on the counter, free to take.",
"Prominently displayed behind the counter is a letter of appreciation from the lady of a local manor house.",
"The keepers in this shop are a pair of identical twins.",
"The shopkeeper is whistling merrily as the customers enter.",
"The shopkeeper is arguing with his assistant as the customers enter.",
"The shopkeeper has a cold, and sneezes throughout the conversation.",
"As the customers enter, the shopkeeper is attempting to cure hiccoughs with a cup of water, with little success.",
"No one has dusted in here in ages. Cobwebs line the corners of the ceiling.",
"The proprietor seems very suspicious of the customers. Or maybe it's all strangers.",
"The shopkeeper has a wooden leg, and it thuds on the floor as he navigates the shop.",
"There is a parrot on a stand here. Sample phrases: 'You're robbing me blind.' 'Just look at the craftsmanship.' 'It belonged to my dear mother.' 'I couldn't let it go for twice that.'",
"The shopkeeper is reading a novel and weeping into a handkerchief.",
"The shopkeeper is obviously a bit inebriated.",
"An enchanted lute fills this shop with quiet music.",
"As the customers enter, the shopkeeper is stalking a fly around the shop with a swatter.",
"The shop's upper walls are decorated with trophies: the heads of horned and antlered game.",
"The shopkeeper has a very serious case of pink eye.",
"On the wall behind the counter several amateur paintings are on display: pictures of various colors of dragons, rendered by an artist with no particular sense of anatomy.",
"On the wall is the banner of a military company that was famously routed in a local battle twenty years ago.",
"The shopkeeper collects pretty stones and crystals on small shelves behind the till.",
"The proprietor offers the customers a cup of wine as they enter: he has just received good news and feels like celebrating.",
"The shopkeeper's three children are playing in the corner of the room.",
"The shopkeeper is a substitute, as the proprietor was called out of town. The stand-in is not particularly knowledgeable about the merchandise or its pricing.",
"There is a large — but entirely mundane — spider in the shop, and the squeamish clerk could use some help dealing with it.",
"The shopkeeper is trying to wrap a parcel on the counter and making a mess of it.",
"The shopkeeper will enthusiastically offer to show customers the sleight-of-hand tricks he has been practicing with coins or cards.",
"The shopkeeper is very mistrustful and will examine each coin carefully.",
"The proprietor is good at his craft, but terrible at business. His teenage daughter will try to intervene and manage all negotiations about price.",
"The doors and windows of this shop are surrounded by tiny painted runes meant to avert misfortune.",
"There is a bell on the counter which will ring if any lie is told in its presence.",
"There is a member of local law enforcement (e.g. City Watch, Sheriff's Deputy) also shopping here.",
"The shopkeeper is desperate for funds and will cut prices if pressed.",
"The shopkeeper resents that they recently got swindled, and will be inflexible about pricing.",
"The shopkeeper is eager to close shop to get to the tavern.",
"The shopkeeper is badly hung over.",
"The shopkeeper is actually a thief who broke in, knowing that the actual proprietor was sick today. The party's entrance surprised him, but he will try to play it off.",
"The shopkeeper is wearing a poultice on his shoulder for a rash. It smells awful.",
"The shopkeeper is very suspicious of dwarves.",
"The shopkeeper is enamored of the warrior lifestyle, and will try to engage in conversation with any fighter who comes into their shop.",
"The shopkeeper has heard rumor of one the the party, for good or ill.",
"The shop is uncomfortably cramped, with merchandise stacked everywhere. Any customer in armor or carrying weapons risks knocking merchandise to the stone floor.",
"The proprietor sits behind an iron screen for security. Money is passed in, and merchandise comes out through a heavy door.",
"The proprietor is in the back of the shop. There is a bell to ring for service.",
"There is a sign with a symbol of an evil eye. It reads, 'My Curse Upon All Light-fingered Scoundrels.'",
"Garlands of fresh flowers decorate the counter and shelves of this shop.",
"The proprietor is reading a book on military history as the customers enter.",
"The proprietor is reading a book on herbalism as the customers enter.",
"The shop is panelled with knotty planks of wood. The effect is warm and inviting.",
"Two locals play cards at a small table while the shopkeeper minds the till.",
"There are two dice in a dish on the counter. The shopkeeper is a compulsive gambler who will suggest letting a dice roll determine double-or-nothing pricing. (Roll a d6 each, highest wins, re-roll a tie.)",
"The shopkeeper is a burly man who will grant a one-time 50% discount to anyone who can beat him at arm wrestling. (He is Strength 17. Roll three Strength checks, best two out of three wins.)",
"As a thank-you, the shopkeeper includes a small home-baked cake with your purchase. It is delicious."
			]
		}
	]
}
